source/_static/diagrams/22-writing-an-easyblock-2.d2
direction: right
n0: "EasyBlock subclass"
n1: "configure_step"
n2: "build_step"
n3: "install_step"
n0 -> n1
n2 -> n3
